package com.epam.mikhail_gorbachenko.java.lesson1.task1;

/**
 * Написать программу, осуществляющую обработку массива.
 * Исходные условия: массив содержит только целые числа от -10 до 10,
 * программа должна выводить в консоль исходный массив и полученный результат,
 * количество элементов в массиве 20.
 */

public class ArrayHandler {

    public static void main(String[] args) {

    }

    /**
     * Вариант 1:
     * В массиве целых чисел поменять местами максимальный отрицательный элемент  и минимальный положительный.
     */
    public void option1(){

    }

}
